# Function Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FunctionId..::..Function Property
FunctionId Class See Also
---
The name of the function throwing an exception.
**Namespace:** Autodesk.Revit.Exceptions**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string Function { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Function As String
	Get
```

Visual C++
---
```text
public:
property String^ Function {
	String^ get ();
}
```

# See Also
FunctionId Class
Autodesk.Revit.Exceptions Namespace